app/controllers/articles_controller.rb

    def index
        @requests = Request.all.reverse
---
SELECT "requests".* FROM "requests"

    def new
       @requests = Request.last(5).reverse
---
SELECT "requests".* FROM "requests" ORDER BY "requests"."id" DESC LIMIT ?  [["LIMIT", 5]]

    def create

        @request = Request.new(article_params)

        entry = Services::Entries.new(@request.lang,@request.text)

        response = entry.executeService

        @request.response = response

        @request.save

        @requests = Request.last(5).reverse
---
INSERT INTO "requests" ("lang", "text", "response", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["lang", "e"], ["text", "e"], ["response", ""], ["created_at", "2020-09-18 03:05:29.074838"], ["updated_at", "2020-09-18 03:05:29.074838"]]
SELECT "requests".* FROM "requests" ORDER BY "requests"."id" DESC LIMIT ?  [["LIMIT", 5]]